{
  "format": "layers-model",
  "generatedBy": "keras v3.10.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                300
              ],
              "batch_input_shape": [
                null,
                300
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_layer"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [
                null,
                300
              ],
              "input_dim": 30000,
              "output_dim": 100,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 300
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 100,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {},
                    "module": "keras.initializers",
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                },
                "registered_name": null
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {},
                "module": "keras.initializers",
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [
          null,
          300
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-07,
          "amsgrad": false,
          "weight_decay": null,
          "clipnorm": null,
          "clipvalue": null,
          "global_clipnorm": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": true,
          "is_legacy_optimizer": true
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "sequential/bidirectional/forward_lstm/lstm_cell/kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/bidirectional/forward_lstm/lstm_cell/recurrent_kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/bidirectional/forward_lstm/lstm_cell/bias",
          "shape": [
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/bidirectional/backward_lstm/lstm_cell/kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/bidirectional/backward_lstm/lstm_cell/recurrent_kernel",
          "shape": [
            100,
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/bidirectional/backward_lstm/lstm_cell/bias",
          "shape": [
            400
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/kernel",
          "shape": [
            200,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "sequential/embedding/embeddings",
          "shape": [
            30000,
            100
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
